[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Mother-in-Law’s Tongue, is a hardy indoor plant that thrives in low light and requires minimal watering. It helps purify indoor air by removing toxins and is ideal for beginners seeking a low-maintenance yet attractive green addition to their space.",
    "image": "/images/snake_plant.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": 22,
    "rating": 4.9,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "Peace Lily is an elegant indoor plant with glossy leaves and white blooms. It efficiently purifies the air and thrives in indirect light. This tropical beauty is perfect for homes or offices, adding calm and freshness while requiring only moderate watering and care to stay healthy.",
    "image": "/images/peace_lily.jpg",
    "providerName": "GreenLeaf Haven"
  },
  {
    "plantId": 3,
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": 15,
    "rating": 4.8,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "Aloe Vera is a succulent known for its soothing gel used in skincare and first aid. It thrives in bright sunlight and requires minimal watering. With its medicinal benefits and easy maintenance, Aloe Vera makes an excellent addition to homes seeking a natural health remedy and green touch.",
    "image": "/images/aloe_vera.jpg",
    "providerName": "Nature's Touch"
  },
  {
    "plantId": 4,
    "plantName": "Chinese Evergreen",
    "category": "Foliage Plant",
    "price": 21,
    "rating": 4.6,
    "availableStock": 11,
    "careLevel": "Easy",
    "description": "Chinese Evergreen is prized for its striking patterned leaves and adaptability. It tolerates low light and infrequent watering, making it one of the best beginner-friendly decorative houseplants.",
    "image": "/images/chinese_everGreen.jpg",
    "providerName": "LeafyLuxe Nursery"
  },
  {
    "plantId": 5,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 17,
    "rating": 4.5,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "Spider Plant is a popular indoor plant with long, striped leaves that grow beautifully in hanging pots. It is known for improving indoor air quality and adapting well to various lighting conditions. Easy to grow and propagate, it’s perfect for both beginners and experienced plant lovers.",
    "image": "/images/spider_plant.jpg",
    "providerName": "Leafy Lane Nursery"
  },
  {
    "plantId": 6,
    "plantName": "Boston Fern",
    "category": "Fern",
    "price": 20,
    "rating": 4.4,
    "availableStock": 9,
    "careLevel": "Medium",
    "description": "Boston Fern is a classic houseplant featuring lush green fronds that add freshness to any space. It prefers high humidity, indirect light, and regular misting. This elegant fern not only looks beautiful but also helps purify the air, making it a wonderful choice for home interiors.",
    "image": "/images/boston_fern.jpg",
    "providerName": "Evergreen Garden"
  },
  {
    "plantId": 7,
    "plantName": "Rubber Plant",
    "category": "Foliage",
    "price": 25,
    "rating": 4.8,
    "availableStock": 11,
    "careLevel": "Medium",
    "description": "Rubber Plant is a stylish indoor plant with thick, glossy leaves that thrive in bright, indirect sunlight. It’s known for improving air quality and bringing a modern, tropical look to interiors. With occasional watering and light pruning, it remains healthy and vibrant all year round.",
    "image": "/images/rubber_plant.jpg",
    "providerName": "UrbanLeaf Studio"
  },
  {
    "plantId": 8,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 16,
    "rating": 4.6,
    "availableStock": 14,
    "careLevel": "Easy",
    "description": "The Jade Plant, often called the money plant, is a long-living succulent with thick, glossy leaves. It symbolizes prosperity and is ideal for bright, sunny spaces. Jade Plants require little watering and are easy to care for, making them great companions for home or office desks.",
    "image": "/images/jade_plant.jpg",
    "providerName": "Succulent World"
  },
  {
    "plantId": 9,
    "plantName": "Pothos",
    "category": "Vine",
    "price": 14,
    "rating": 4.7,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "Pothos is a fast-growing vine with heart-shaped green leaves, perfect for hanging baskets or shelves. It thrives in low to bright light and requires little attention. Its ability to remove indoor toxins makes it a favorite for anyone wanting a beautiful, low-maintenance indoor plant.",
    "image": "/images/pothos.jpg",
    "providerName": "GreenScape Living"
  },
  {
    "plantId": 10,
    "plantName": "Areca Palm",
    "category": "Indoor Palm",
    "price": 30,
    "rating": 4.8,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Areca Palm is a lush, tropical plant that brings a refreshing, natural atmosphere to interiors. It grows best in bright, indirect light and humid conditions. Known for its air-purifying qualities, the Areca Palm is ideal for living rooms and offices, offering beauty and clean air effortlessly.",
    "image": "/images/areca_palm.jpg",
    "providerName": "Oasis Greens"
  },
  {
    "plantId": 11,
    "plantName": "Monstera Deliciosa",
    "category": "Foliage",
    "price": 40,
    "rating": 4.8,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "A trendy indoor plant with large, split leaves that adds a tropical vibe to any space.",
    "image": "/images/monster_deliciosa.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 12,
    "plantName": "Calathea Orbifolia",
    "category": "Foliage",
    "price": 32,
    "rating": 4.7,
    "availableStock": 5,
    "careLevel": "Medium",
    "description": "A stunning indoor plant with large, patterned leaves. Prefers indirect light and high humidity.",
    "image": "/images/Calathea_Orbifolia.jpg",
    "providerName": "GreenHome Nursery"
  }
]
